%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%
%A  vspc.msk                     GAP documentation            Willem de Graaf
%A                                                              Thomas Breuer
%%
%A  @(#)$Id$
%%
%Y  (C) 1998 School Math and Comp. Sci., University of St.  Andrews, Scotland
%%
\Chapter{Vector Spaces}

\FileHeader[1]{vspc}

%  IsLeftOperatorRing ... left out

% IsLeftOperatorRingWithOne ... left out

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Constructing Vector Spaces}

\Declaration{VectorSpace}

\beginexample
gap> vecs:= [ [ 1, 2, 3 ], [ 1, 1, 1 ] ];;
gap> V:= VectorSpace( Rationals, vecs );
<vector space over Rationals, with 2 generators>
\endexample

\Declaration{Subspace}

\beginexample
gap> vecs:= [ [ 1, 2, 3 ], [ 1, 1, 1 ] ];;
gap> V:= VectorSpace( Rationals, vecs );;
gap> W:= Subspace( V, [ [ 0, 1, 2 ] ] );
<vector space over Rationals, with 1 generators>
\endexample

\Declaration{SubspaceNC}

\beginexample
gap> vecs:= [ [ 1, 2, 3 ], [ 1, 1, 1 ] ];;
gap> V:= VectorSpace( Rationals, vecs );;
VectorSpace( Rationals, [ [ 0, 1, 2 ] ] )
\endexample

\Declaration{FullRowSpace}

\beginexample
gap> FullRowSpace( GF( 9 ), 3 );  
( GF(3^2)^3 )
\endexample

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Categories and Properties for Vector Spaces}

\Declaration{IsLeftVectorSpace}

\Declaration{IsGaussianSpace}

\beginexample
gap> mats:= [ [[1,1],[2,2]], [[3,4],[0,1]] ];;
gap> V:= VectorSpace( Rationals, mats );;
gap> IsGaussianSpace( V );
true
\endexample

\Declaration{IsSubspacesVectorSpace}

\beginexample
gap> V:= VectorSpace( GF(2^2), [ [ Z(2)^0, 0*Z(2) ], [ 0*Z(2), Z(2)^0 ] ] );;
gap> D:= SubspacesDim( V, 1 );
Subspaces( VectorSpace( GF(2^2), [ [ Z(2)^0, 0*Z(2) ], [ 0*Z(2), Z(2)^0 ] 
 ] ), 1 )
gap> IsSubspacesVectorSpace( D );
true
\endexample


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Operations and Attributes for Vector Spaces}

\Declaration{GeneratorsOfLeftVectorSpace}

\beginexample
gap> vecs:= [ [ 1, 2, 3 ], [ 1, 1, 1 ], [ 1, 1, 1 ] ];;
gap> V:= VectorSpace( Rationals, vecs );;
gap> GeneratorsOfVectorSpace( V );
[ [ 1, 2, 3 ], [ 1, 1, 1 ], [ 1, 1, 1 ] ]
\endexample

\Declaration{NormedRowVectors}
\beginexample
gap> V:= GF(3)^2;;
gap> NormedRowVectors( V );
[ [ 0*Z(3), Z(3)^0 ], [ Z(3)^0, 0*Z(3) ], [ Z(3)^0, Z(3)^0 ], 
  [ Z(3)^0, Z(3) ] ]
\endexample

\Declaration{TrivialSubspace}
\beginexample
gap> V:= GF(3)^3;;                    
gap> TrivialSubspace( V );
<vector space over GF(3), with 0 generators>
\endexample

\Declaration{AsSubspace}

\beginexample
gap> V:= VectorSpace( Rationals, [ [1,2,3], [1,1,1] ] );;
gap> W:= VectorSpace( Rationals, [ [1/2,1/2,1/2] ] );;   
gap> U:= AsSubspace( V, W );
<vector space over Rationals, with 1 generators>
gap> Parent( U ) = V;
true
\endexample

\Declaration{AsVectorSpace}

\beginexample
gap> V:= GF( 27 )^3;
( GF(3^3)^3 )
gap> W:= AsVectorSpace( GF( 3 ), V );
<vector space over GF(3), with 9 generators>
gap> Dimension( W );
9
\endexample

\Declaration{SubspacesDim}

\Declaration{Subspaces}

\beginexample
gap> W:= FullRowSpace( GF( 3 ), 3 );;
gap> Subspaces( W );
Subspaces( ( GF(3)^3 ), "all" )
\endexample


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Bases of Vector Spaces}

\FileHeader{basis}

\Declaration{Basis}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> Basis( V );
SemiEchelonBasis( <vector space over Rationals, with 2 generators>,... )
gap> B:= Basis( V, [ [ 1, 2, 7 ], [ 3, 2, 30 ] ] );
Basis( <vector space over Rationals, with 2 generators>,
[ [ 1, 2, 7 ], [ 3, 2, 30 ] ] )
gap> BasisVectors( B );
[ [ 1, 2, 7 ], [ 3, 2, 30 ] ]
\endexample

%T show the basis vectors in the unary case,
%T show examples where the vectors do not form a basis,
%T show the use of the ``no check'' version

\Declaration{SemiEchelonBasis}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> SemiEchelonBasis( V );
SemiEchelonBasis( <vector space over Rationals, with 2 generators>,...)
gap> B:= SemiEchelonBasis( V, [ [1,2,7],[0,1,-9/4] ] );
SemiEchelonBasis( <vector space over Rationals, with 2 generators>,
  [ [1,2,7],[0,1,-9/4] ] )
\endexample

\Declaration{CanonicalBasis}

\beginexample
gap> vecs:= [ [ 1, 2, 3 ], [ 1, 1, 1 ], [ 1, 1, 1 ] ];;
gap> V:= VectorSpace( Rationals, vecs );;
gap> B:= CanonicalBasis( V );
CanonicalBasis(<vector space over Rationals, with 3 generators>)
gap> BasisVectors( B );
[ [ 1, 0, -1 ], [ 0, 1, 2 ] ]
\endexample




% NewBasis............maybe better in the programmers manual

% RelativeBasis ....... programmers manual ?

\Declaration{IsBasis}

\beginexample
gap> V:= FullRowSpace( GF(2), 6 );;
gap> B:= Basis( V );;
gap> IsBasis( B );
true
\endexample

\Declaration{IsCanonicalBasis}

\Declaration{IsCanonicalBasisFullRowModule}

\Declaration{IsCanonicalBasisFullMatrixModule}

\Declaration{IsIntegralBasis}

\beginexample
gap> F:= GaussianRationals;;
gap> B:= Basis( F );;                                             
gap> IsIntegralBasis(B);
true
\endexample

\Declaration{IsNormalBasis}

\Declaration{IsSemiEchelonized}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> B:= Basis( V, [ [1,2,7],[0,1,-9/4] ] );;           
gap> IsSemiEchelonized(B);
true
\endexample

\Declaration{BasisVectors}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> B:= Basis( V, [ [ 1, 2, 7 ], [ 0, 1, -9/4 ] ] );;
gap> BasisVectors( B ); 
[ [ 1, 2, 7 ], [ 0, 1, -9/4 ] ]
\endexample

\Declaration{StructureConstantsTable}

\beginexample
gap> A:= QuaternionAlgebra( Rationals );;
gap> StructureConstantsTable( Basis( A ) );
[ [ [ [ 1 ], [ 1 ] ], [ [ 2 ], [ 1 ] ], [ [ 3 ], [ 1 ] ], [ [ 4 ], [ 1 ] ] ], 
  [ [ [ 2 ], [ 1 ] ], [ [ 1 ], [ -1 ] ], [ [ 4 ], [ 1 ] ], [ [ 3 ], [ -1 ] ] ], 
  [ [ [ 3 ], [ 1 ] ], [ [ 4 ], [ -1 ] ], [ [ 1 ], [ -1 ] ], [ [ 2 ], [ 1 ] ] ], 
  [ [ [ 4 ], [ 1 ] ], [ [ 3 ], [ 1 ] ], [ [ 2 ], [ -1 ] ], [ [ 1 ], [ -1 ] ] ]
    , 0, 0 ]
\endexample


\Declaration{UnderlyingLeftModule}

\beginexample
gap> V:= FullRowSpace( GF(2), 6 );;                                  
gap> B:= Basis( V );;                                            
gap> UnderlyingLeftModule( B );
( GF(2)^6 )
\endexample

\Declaration{Coefficients}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> B:= Basis( V, [ [ 1, 2, 7 ], [ 0, 1, -9/4 ] ] );;
gap> Coefficients( B, [ 1/2, 1/3, 5 ] );
[ 1/2, -2/3 ]
\endexample

\Declaration{LinearCombination}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> B:= Basis( V, [ [ 1, 2, 7 ], [ 0, 1, -9/4 ] ] );;
gap> LinearCombination( B, [ 1/2, -2/3 ] );
[ 1/2, 1/3, 5 ]
\endexample

\Declaration{SiftedVector}

\beginexample
gap> V:= VectorSpace( Rationals, [ [ 1, 2, 7 ], [ 1/2, 1/3, 5 ] ] );;
gap> B:= Basis( V );;
gap> SiftedVector( B, [ 1, 2, 8 ] );                    
[ 0, 0, 1 ]
\endexample

\Declaration{EnumeratorByBasis}

\beginexample
gap> V:= Rationals^3;;
gap> EnumeratorByBasis( Basis( V ) );
<enumerator of ( Rationals^3 )>
\endexample

\Declaration{IteratorByBasis}

\beginexample
gap> V:= Rationals^3;;
gap> IteratorByBasis( Basis( V ) );       
<iterator>
\endexample

% IsBasisByNiceBasis ...........prog-man?

% NiceBasis...............prog-man?

% NiceBasisNC...............prog-man?

% NiceFreeLeftModule............prog-man?

% PrepareNiceFreeLeftModule .............. prog-man?

% NiceVector ..................... prog-man?


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Mutable Bases}

\FileHeader{basismut}

\Declaration{IsMutableBasis}

\Declaration{MutableBasis}

\beginexample
gap> MB:= MutableBasis( Rationals, [ [ 1, 2, 3 ], [ 0, 1, 0 ] ] );
<mutable basis over Rationals, 2 vectors>
\endexample

% MutableBasisViaNiceMutableBasisMethod2( <R>, <vectors> ) .........left out
% MutableBasisViaNiceMutableBasisMethod3( <R>, <vectors>, <zero> )

\Declaration{NrBasisVectors}

\beginexample
gap> MB:= MutableBasis( Rationals, [ [ 1, 1], [ 2, 2 ] ] );;       
gap> NrBasisVectors( MB );
1
\endexample

\Declaration{ImmutableBasis}

\beginexample
gap> MB:= MutableBasis( Rationals, [ [ 1, 1], [ 2, 2 ] ] );;
gap> B:= ImmutableBasis( MB );
SemiEchelonBasis( <vector space of dimension 1 over Rationals>, [ [ 1, 1 ] ] )
gap> UnderlyingLeftModule( B );
<vector space of dimension 1 over Rationals>
\endexample

\Declaration{IsContainedInSpan}

\beginexample
gap> MB:= MutableBasis( Rationals, [ [ 1, 1, 3 ], [ 2, 2, 1 ] ] );;
gap> IsContainedInSpan( MB, [ 1, 1, 1 ] );
true
gap> IsContainedInSpan( MB, [ 1, 0, 0 ] );
false
\endexample

\Declaration{CloseMutableBasis}

\beginexample
gap> MB:= MutableBasis( Rationals, [ [ 1, 1, 3 ], [ 2, 2, 1 ] ] ); 
<mutable basis over Rationals, 2 vectors>
gap> IsContainedInSpan( MB, [ 1, 0, 0 ] );
false
gap> CloseMutableBasis( MB, [ 1, 0, 0 ] );
gap> MB;
<mutable basis over Rationals, 3 vectors>
\endexample


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Vector Space Homomorphisms}

\Declaration{LeftModuleGeneralMappingByImages}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> W:= VectorSpace( Rationals, [ [1,2,3], [1,0,1] ] );;
gap> f:= LeftModuleGeneralMappingByImages( V, W, 
>                                [[1,0],[2,0]], [[1,0,1],[1,0,1] ] );
[ [ 1, 0 ], [ 2, 0 ] ] -> [ [ 1, 0, 1 ], [ 1, 0, 1 ] ]
gap> IsMapping( f );
false
\endexample

\Declaration{LeftModuleHomomorphismByImages}

\beginexample
gap> V:=FullRowSpace( Rationals, 2 );;
gap> W:=VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> f:=LeftModuleHomomorphismByImages( V, W,                                 
> [ [ 1, 0 ], [ 0, 1 ] ], [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );
[ [ 1, 0 ], [ 0, 1 ] ] -> [ [ 1, 0, 1 ], [ 1, 2, 3 ] ]
gap> Image( f, [1,1] );
[ 2, 2, 4 ]
\endexample

\Declaration{LeftModuleHomomorphismByImagesNC}

\beginexample
gap> V:=FullRowSpace( Rationals, 2 );;
gap> W:=VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> f:= LeftModuleHomomorphismByImagesNC( V, W,
> [ [ 1, 0 ], [ 0, 1 ] ], [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );
[ [ 1, 0 ], [ 0, 1 ] ] -> [ [ 1, 0, 1 ], [ 1, 2, 3 ] ]
\endexample

\Declaration{LeftModuleHomomorphismByMatrix}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> W:= VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> f:= LeftModuleHomomorphismByMatrix( Basis( V ), 
> [ [ 1, 2 ], [ 3, 1 ] ], Basis( W ) );
<linear mapping by matrix, ( Rationals^2 ) -> VectorSpace( Rationals, 
[ [ 1, 0, 1 ], [ 1, 2, 3 ] ] )>
\endexample

\Declaration{NaturalHomomorphismBySubspace}

\beginexample
gap> V:= FullRowSpace( Rationals, 3 );;
gap> W:= VectorSpace( Rationals, [ [ 1, 1, 1 ] ] );;                   
gap> f:= NaturalHomomorphismBySubspace( V, W );
<linear mapping by matrix, ( Rationals^3 ) -> ( Rationals^2 )>
\endexample

\Declaration{Hom}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> W:= VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> H:= Hom( Rationals, V, W );
Hom( Rationals, ( Rationals^2 ), VectorSpace( Rationals, 
[ [ 1, 0, 1 ], [ 1, 2, 3 ] ] ) )
gap> Dimension( H );
4
\endexample

\Declaration{End}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> A:= End( Rationals, V );
End( Rationals, ( Rationals^2 ) )
gap> Dimension( A );
4
\endexample

\Declaration{IsFullHomModule}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> W:= VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> H:= Hom( Rationals, V, W );;
gap> IsFullHomModule( H );
true
\endexample

\Declaration{IsPseudoCanonicalBasisFullHomModule}

\beginexample
gap> V:= FullRowSpace( Rationals, 2 );;
gap> W:= VectorSpace( Rationals, [ [ 1, 0, 1 ], [ 1, 2, 3 ] ] );;
gap> H:= Hom( Rationals, V, W );; B:= Basis( H );;
gap> IsPseudoCanonicalBasisFullHomModule( B );
true
\endexample


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%
%E

